<?php


return array(
    10001 => '参数缺失说明',
    10002 => '查询失败说明',
    10003 => '存在重复值',
    10004 => '正则匹配错误提示',
    10005 => '数据添加失败提示',
    10006 => '数据修改失败提示',
    10007 => '数据错误提示',
    10008 => '数据不存在提示',
    10009 => '数据删除失败提示',
    10010 => '请求方式错误提示',
    10011 => '短信验证码错误',
    10012 => '登陆失效',
    10013 => '手机号已存在',
    10014 => '实名信息已存在',
    10015 => '验证码错误',
    10086=>'该月卡未同步,请提交保存之后，重试',
    10016 => '该时间段暂不支持扫码进场',

    20001 => 'protobuf encode参数错误',
    20002 => 'protobuf decode参数错误',

    90002 => '其他内容说明',
    90001 => '定义错误code给出默认的code',
    90000 => 'token验证错误或者过期',
    90003 => '登录用户被挤下线提示',

    100 => 'options预检',
    101 => '请求错误',
    102 => '您已退出',

);

?>
